{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v4.12.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "flat_efficientnetB1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_23"}, "name": "input_23", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "augmentation_layers", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_24"}, "name": "input_24", "inbound_nodes": []}, {"class_name": "RandomFlip", "config": {"name": "random_flip_2", "trainable": true, "dtype": "float32", "mode": "horizontal_and_vertical", "seed": null}, "name": "random_flip_2", "inbound_nodes": [[["input_24", 0, 0, {}]]]}, {"class_name": "RandomRotation", "config": {"name": "random_rotation_2", "trainable": true, "dtype": "float32", "factor": 0.2, "fill_mode": "reflect", "fill_value": 0.0, "interpolation": "bilinear", "seed": null}, "name": "random_rotation_2", "inbound_nodes": [[["random_flip_2", 0, 0, {}]]]}], "input_layers": [["input_24", 0, 0]], "output_layers": [["random_rotation_2", 0, 0]]}, "name": "augmentation_layers", "inbound_nodes": [[["input_23", 0, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "preprocessing_layers", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_25"}, "name": "input_25", "inbound_nodes": []}], "input_layers": [["input_25", 0, 0]], "output_layers": [["input_25", 0, 0]]}, "name": "preprocessing_layers", "inbound_nodes": [[["augmentation_layers", 1, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "efficientnetb1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_26"}, "name": "input_26", "inbound_nodes": []}, {"class_name": "Rescaling", "config": {"name": "rescaling_2", "trainable": false, "dtype": "float32", "scale": 0.00392156862745098, "offset": 0.0}, "name": "rescaling_2", "inbound_nodes": [[["input_26", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_2", "trainable": false, "dtype": "float32", "axis": [3], "mean": null, "variance": null}, "name": "normalization_2", "inbound_nodes": [[["rescaling_2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stem_conv_pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "stem_conv_pad", "inbound_nodes": [[["normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_conv", "inbound_nodes": [[["stem_conv_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_bn", "inbound_nodes": [[["stem_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "stem_activation", "inbound_nodes": [[["stem_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block1a_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block1a_dwconv", "inbound_nodes": [[["stem_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_bn", "inbound_nodes": [[["block1a_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1a_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block1a_activation", "inbound_nodes": [[["block1a_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block1a_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block1a_se_squeeze", "inbound_nodes": [[["block1a_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block1a_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 32]}, "name": "block1a_se_reshape", "inbound_nodes": [[["block1a_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_se_reduce", "trainable": false, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_se_reduce", "inbound_nodes": [[["block1a_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_se_expand", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_se_expand", "inbound_nodes": [[["block1a_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block1a_se_excite", "trainable": false, "dtype": "float32"}, "name": "block1a_se_excite", "inbound_nodes": [[["block1a_activation", 0, 0, {}], ["block1a_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_project_conv", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_project_conv", "inbound_nodes": [[["block1a_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_project_bn", "inbound_nodes": [[["block1a_project_conv", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block1b_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block1b_dwconv", "inbound_nodes": [[["block1a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1b_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1b_bn", "inbound_nodes": [[["block1b_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1b_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block1b_activation", "inbound_nodes": [[["block1b_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block1b_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block1b_se_squeeze", "inbound_nodes": [[["block1b_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block1b_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 16]}, "name": "block1b_se_reshape", "inbound_nodes": [[["block1b_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1b_se_reduce", "trainable": false, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1b_se_reduce", "inbound_nodes": [[["block1b_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1b_se_expand", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1b_se_expand", "inbound_nodes": [[["block1b_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block1b_se_excite", "trainable": false, "dtype": "float32"}, "name": "block1b_se_excite", "inbound_nodes": [[["block1b_activation", 0, 0, {}], ["block1b_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1b_project_conv", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1b_project_conv", "inbound_nodes": [[["block1b_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1b_project_bn", "inbound_nodes": [[["block1b_project_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "block1b_drop", "trainable": false, "dtype": "float32", "rate": 0.008695652173913044, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block1b_drop", "inbound_nodes": [[["block1b_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block1b_add", "trainable": false, "dtype": "float32"}, "name": "block1b_add", "inbound_nodes": [[["block1b_drop", 0, 0, {}], ["block1a_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_expand_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_expand_conv", "inbound_nodes": [[["block1b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_expand_bn", "inbound_nodes": [[["block2a_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2a_expand_activation", "inbound_nodes": [[["block2a_expand_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "block2a_dwconv_pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "block2a_dwconv_pad", "inbound_nodes": [[["block2a_expand_activation", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2a_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2a_dwconv", "inbound_nodes": [[["block2a_dwconv_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_bn", "inbound_nodes": [[["block2a_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2a_activation", "inbound_nodes": [[["block2a_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2a_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block2a_se_squeeze", "inbound_nodes": [[["block2a_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2a_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 96]}, "name": "block2a_se_reshape", "inbound_nodes": [[["block2a_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_se_reduce", "trainable": false, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_se_reduce", "inbound_nodes": [[["block2a_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_se_expand", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_se_expand", "inbound_nodes": [[["block2a_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2a_se_excite", "trainable": false, "dtype": "float32"}, "name": "block2a_se_excite", "inbound_nodes": [[["block2a_activation", 0, 0, {}], ["block2a_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_project_conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_project_conv", "inbound_nodes": [[["block2a_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_project_bn", "inbound_nodes": [[["block2a_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_expand_conv", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_expand_conv", "inbound_nodes": [[["block2a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_expand_bn", "inbound_nodes": [[["block2b_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2b_expand_activation", "inbound_nodes": [[["block2b_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2b_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2b_dwconv", "inbound_nodes": [[["block2b_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_bn", "inbound_nodes": [[["block2b_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2b_activation", "inbound_nodes": [[["block2b_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2b_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block2b_se_squeeze", "inbound_nodes": [[["block2b_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2b_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 144]}, "name": "block2b_se_reshape", "inbound_nodes": [[["block2b_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_se_reduce", "trainable": false, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_se_reduce", "inbound_nodes": [[["block2b_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_se_expand", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_se_expand", "inbound_nodes": [[["block2b_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2b_se_excite", "trainable": false, "dtype": "float32"}, "name": "block2b_se_excite", "inbound_nodes": [[["block2b_activation", 0, 0, {}], ["block2b_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_project_conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_project_conv", "inbound_nodes": [[["block2b_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_project_bn", "inbound_nodes": [[["block2b_project_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "block2b_drop", "trainable": false, "dtype": "float32", "rate": 0.026086956521739136, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block2b_drop", "inbound_nodes": [[["block2b_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2b_add", "trainable": false, "dtype": "float32"}, "name": "block2b_add", "inbound_nodes": [[["block2b_drop", 0, 0, {}], ["block2a_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_expand_conv", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_expand_conv", "inbound_nodes": [[["block2b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2c_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2c_expand_bn", "inbound_nodes": [[["block2c_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2c_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2c_expand_activation", "inbound_nodes": [[["block2c_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2c_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2c_dwconv", "inbound_nodes": [[["block2c_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2c_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2c_bn", "inbound_nodes": [[["block2c_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2c_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2c_activation", "inbound_nodes": [[["block2c_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2c_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block2c_se_squeeze", "inbound_nodes": [[["block2c_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2c_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 144]}, "name": "block2c_se_reshape", "inbound_nodes": [[["block2c_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_se_reduce", "trainable": false, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_se_reduce", "inbound_nodes": [[["block2c_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_se_expand", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_se_expand", "inbound_nodes": [[["block2c_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2c_se_excite", "trainable": false, "dtype": "float32"}, "name": "block2c_se_excite", "inbound_nodes": [[["block2c_activation", 0, 0, {}], ["block2c_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_project_conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_project_conv", "inbound_nodes": [[["block2c_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2c_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2c_project_bn", "inbound_nodes": [[["block2c_project_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "block2c_drop", "trainable": false, "dtype": "float32", "rate": 0.034782608695652174, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block2c_drop", "inbound_nodes": [[["block2c_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2c_add", "trainable": false, "dtype": "float32"}, "name": "block2c_add", "inbound_nodes": [[["block2c_drop", 0, 0, {}], ["block2b_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_expand_conv", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_expand_conv", "inbound_nodes": [[["block2c_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3a_expand_bn", "inbound_nodes": [[["block3a_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3a_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3a_expand_activation", "inbound_nodes": [[["block3a_expand_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "block3a_dwconv_pad", "trainable": false, "dtype": "float32", "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "name": "block3a_dwconv_pad", "inbound_nodes": [[["block3a_expand_activation", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block3a_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block3a_dwconv", "inbound_nodes": [[["block3a_dwconv_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3a_bn", "inbound_nodes": [[["block3a_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3a_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3a_activation", "inbound_nodes": [[["block3a_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block3a_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block3a_se_squeeze", "inbound_nodes": [[["block3a_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block3a_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 144]}, "name": "block3a_se_reshape", "inbound_nodes": [[["block3a_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_se_reduce", "trainable": false, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_se_reduce", "inbound_nodes": [[["block3a_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_se_expand", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_se_expand", "inbound_nodes": [[["block3a_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block3a_se_excite", "trainable": false, "dtype": "float32"}, "name": "block3a_se_excite", "inbound_nodes": [[["block3a_activation", 0, 0, {}], ["block3a_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_project_conv", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_project_conv", "inbound_nodes": [[["block3a_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3a_project_bn", "inbound_nodes": [[["block3a_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_expand_conv", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_expand_conv", "inbound_nodes": [[["block3a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3b_expand_bn", "inbound_nodes": [[["block3b_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3b_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3b_expand_activation", "inbound_nodes": [[["block3b_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block3b_dwconv", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block3b_dwconv", "inbound_nodes": [[["block3b_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3b_bn", "inbound_nodes": [[["block3b_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3b_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3b_activation", "inbound_nodes": [[["block3b_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block3b_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block3b_se_squeeze", "inbound_nodes": [[["block3b_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block3b_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 240]}, "name": "block3b_se_reshape", "inbound_nodes": [[["block3b_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_se_reduce", "trainable": false, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_se_reduce", "inbound_nodes": [[["block3b_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_se_expand", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_se_expand", "inbound_nodes": [[["block3b_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block3b_se_excite", "trainable": false, "dtype": "float32"}, "name": "block3b_se_excite", "inbound_nodes": [[["block3b_activation", 0, 0, {}], ["block3b_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_project_conv", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_project_conv", "inbound_nodes": [[["block3b_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, 